{
    "characters" : {
        "heading" : "Meet the Explorers!",
        "intro" : "(Click a character to learn more about them)",
        "images" : [
        { "description": "Aurora: A brave and curious young explorer. She leads the adventure with heart and courage." },
        { "description": "Rick: Aurora's best friend. He's clever and a little sarcastic, but always reliable." },
        { "description": "Dog: Loyal, smart, and always sniffing out secrets. He may be just a dog, but he's part of the team."}
        ]
    },

    "buttons" : [
        "<button class='choice-button'></button>",
        "<button class='choice-button'></button>",
        "<button class='choice-button'></button>"
],

    "chapter1" : {
        "heading" : "Chapter 1",
        "story" : "The jungle hums with life — birds call through the trees, insects buzz unseen, and a soft breeze carries something strange… like a whisper. Aurora pushes aside a curtain of thick vines. She’s brave, curious, and always ready for a new mystery. Today, the mystery is deeper than ever. Behind her is Rick, her best friend — quick-witted, a little sarcastic, but always dependable. He checks their map, eyes locked on the strange swirling symbol marked in faded ink. Dog trots ahead, tail wagging. He’s loyal, smart, and has a nose for hidden things. Right now, that nose is pulling him toward something just out of sight.<br> Aurora:<em> “Alright team… let’s find out what the jungle is trying to tell us.”</em><br> They reach a small clearing. Three paths lie ahead, each calling to them in a different way.",
        "choices-question" : "What should the team do first?",
        "choices" : [
        {"choice": "Follow the path deeper into the jungle"},
        {"choice": "Climb a nearby rock to look around"},
        {"choice": "Let Dog lead the way"}
        ]
},

    "chapter2" : {
        "heading" :"Chapter 2",
        "story" : [
            {"story" : "The tunnel of vines narrowed, brushing against their shoulders as the green light dimmed. Dog’s growl deepened into a steady rumble, warning of something unseen. Suddenly, the path widened into a shaded clearing, where an ancient stone tablet lay nestled in roots. Glowing with the familiar swirl, it seemed to call to Aurora. She pressed her palm to the carving. The swirl shimmered, then pulsed like a heartbeat. Dog barked sharply as the vines surrounding them twisted aside, revealing a trail hidden by centuries.<br><br>Aurora:<em> “The jungle just answered us.” </em> <br><br>They stepped onto the new path and stopped short before an immense stone arch, its surface etched with the same swirling glyph. As a breeze rustled the leaves, a whisper not carried by wind crept into their minds.<br><br>Aurora: <em>“We’re not alone.”</em>"},
            {"story" : "From a rocky outcrop, they scanned the dense green below. Rick pointed toward a grove veiled in mist. Hacking through ferns and thorns, they reached it—silent, glowing faintly. In the center, a flat stone bore the radiant swirl. Aurora knelt and touched it gently. A soft hum rose, steady and warm. Dog barked twice, leapt to the left, and vines slithered apart as though obeying a command. A passageway emerged. <br><br> Rick:<em> “Something’s guiding us.”</em> <br><br> With growing awe, they followed the opening through the trees until they halted at the foot of a towering stone arch. The swirl reappeared—bold and ancient. Then came the sound: a murmur, just on the edge of language, curling through their thoughts like a forgotten dream. <br> Aurora:<em> “We’re not alone.” </em>"},
            {"story" : "Dog’s ears twitched and he darted ahead, tail high. He led them past swaying moss curtains into a shadowed crevice—barely a cave. Inside, dust danced in beams of light slicing through cracks in the rock. In the center stood a small pedestal with a timeworn tablet etched with the swirl. Dog, curious as ever, pawed at it. The symbol burst with light, bathing the cave in gold Aurora gasped. At the far wall, vines untwined and slid apart as if moved by invisible hands. <br><br> Rick:<em> “Dog’s got this figured out.”</em> <br><br> As they emerged, they found a wide, ancient path that led to a stone arch carved with the now-familiar swirl. The jungle fell silent. Then, a breathless whisper stirred deep in their minds—chilling, wordless, aware. <br><br> Aurora:<em> “We’re not alone.”</em>"}
        ]
    }
}