{
    "main" : {
        "heading" : "Welcome to Jungle of Whispers!",
        "intro" : "This is an interactive story game about a group of young explorers on a mysterious adventure deep in the jungle. You’ll make choices, discover hidden secrets, and guide the team through exciting and unexpected moments. Every decision changes how the story begins — but all paths lead to the same mysterious journey.<br> <br> Ready to begin? <br> <br> Good luck, explorer. The jungle is calling. <br><br> Enter your name to meet the characters!"
    },

    "characters" : {
        "heading" : "Meet the Explorers!",
        "intro" : "(Click a character to learn more about them)",
        "images" : [
        { "description": "Aurora: A brave and curious young explorer. She leads the adventure with heart and courage." },
        { "description": "Rick: Aurora's best friend. He's clever and a little sarcastic, but always reliable." },
        { "description": "Dog: Loyal, smart, and always sniffing out secrets. He may be just a dog, but he's part of the team."}
        ]
    },

    "buttons" : [
        "<button class='choice-button'></button>",
        "<button class='choice-button'></button>",
        "<button class='choice-button'></button>"
],

    "chapter1" : {
        "heading" : "Chapter 1",
        "story" : "The jungle hums with life — birds call through the trees, insects buzz unseen, and a soft breeze carries something strange… like a whisper. Aurora pushes aside a curtain of thick vines. She’s brave, curious, and always ready for a new mystery. Today, the mystery is deeper than ever. Behind her is Rick, her best friend — quick-witted, a little sarcastic, but always dependable. He checks their map, eyes locked on the strange swirling symbol marked in faded ink. Dog trots ahead, tail wagging. He’s loyal, smart, and has a nose for hidden things. Right now, that nose is pulling him toward something just out of sight.<br> Aurora:<em> “Alright team… let’s find out what the jungle is trying to tell us.”</em><br> They reach a small clearing. Three paths lie ahead, each calling to them in a different way.",
        "choices-question" : "What should the team do first?",
        "choices" : [
        {"choice": "Follow the path deeper into the jungle"},
        {"choice": "Climb a nearby rock to look around"},
        {"choice": "Let Dog lead the way"}
        ]
},

    "chapter2" : {
        "heading" :"Chapter 2",
        "story" : [
            {"story" : "The tunnel of vines narrowed, brushing against their shoulders as the green light dimmed. Dog’s growl deepened into a steady rumble, warning of something unseen. Suddenly, the path widened into a shaded clearing, where an ancient stone tablet lay nestled in roots. Glowing with the familiar swirl, it seemed to call to Aurora. She pressed her palm to the carving. The swirl shimmered, then pulsed like a heartbeat. Dog barked sharply as the vines surrounding them twisted aside, revealing a trail hidden by centuries.<br><br>Aurora:<em> “The jungle just answered us.” </em> <br><br>They stepped onto the new path and stopped short before an immense stone arch, its surface etched with the same swirling glyph. As a breeze rustled the leaves, a whisper not carried by wind crept into their minds.<br><br>Aurora: <em>“We’re not alone.”</em>"},
            {"story" : "From a rocky outcrop, they scanned the dense green below. Rick pointed toward a grove veiled in mist. Hacking through ferns and thorns, they reached it—silent, glowing faintly. In the center, a flat stone bore the radiant swirl. Aurora knelt and touched it gently. A soft hum rose, steady and warm. Dog barked twice, leapt to the left, and vines slithered apart as though obeying a command. A passageway emerged. <br><br> Rick:<em> “Something’s guiding us.”</em> <br><br> With growing awe, they followed the opening through the trees until they halted at the foot of a towering stone arch. The swirl reappeared—bold and ancient. Then came the sound: a murmur, just on the edge of language, curling through their thoughts like a forgotten dream. <br> Aurora:<em> “We’re not alone.” </em>"},
            {"story" : "Dog’s ears twitched and he darted ahead, tail high. He led them past swaying moss curtains into a shadowed crevice—barely a cave. Inside, dust danced in beams of light slicing through cracks in the rock. In the center stood a small pedestal with a timeworn tablet etched with the swirl. Dog, curious as ever, pawed at it. The symbol burst with light, bathing the cave in gold Aurora gasped. At the far wall, vines untwined and slid apart as if moved by invisible hands. <br><br> Rick:<em> “Dog’s got this figured out.”</em> <br><br> As they emerged, they found a wide, ancient path that led to a stone arch carved with the now-familiar swirl. The jungle fell silent. Then, a breathless whisper stirred deep in their minds—chilling, wordless, aware. <br><br> Aurora:<em> “We’re not alone.”</em>"}
        ]
    },

    "chapter3" : {
        "heading" :"Chapter 3",
        "story" : "Aurora, Rick, and Dog step through the glowing arch and find themselves atop a wide stone staircase. The jungle's whispers vanish, replaced by a deep, quiet stillness. As they descend, the cool air brushes against their skin. At the bottom, they enter a vast chamber dimly lit by crystals glowing softly in the walls. The room feels ancient—covered in swirling murals, forgotten symbols, and carved vines that seem to watch them. <br><br>In the center stands a low stone platform with three levers, each marked with a unique symbol. Above them, the familiar swirl glows faintly, as if waiting. Dog sniffs the air, his tail twitching with curiosity. Everything around them hums with silent possibilities.",
        "choices-question" : "What will the team explore first?",
        "choices" : [
        {"choice": "Symbools on the walls"},
        {"choice": "Platform and the levers"},
        {"choice": "Let Dog explore the room"}
        ]
    },

    "chapter4" : {
        "heading" :"Chapter 4",
        "story" : [
            {"story" : "Aurora and Rick walk slowly along the wall, looking at the old carvings. There are pictures of people standing near the swirl symbol, holding something that shines. Some images show temples, stars, and animals. It looks like the history of the Eye of Life.b  <br><br>Rick:<em> “These stories are really old... I think they’re showing how the Eye was found and protected.”</em> <br><br>Dog stays close to them, sniffing the floor. He lets out a soft bark when he finds a tiny carving shaped like a leaf. The room feels peaceful. The lights on the walls flicker softly, like the temple is watching them kindly. The three of them meet again in the center of the room. They don’t know what’s coming next, but the temple doesn’t feel scary. It feels special. The Eye of Life must be clos"},
            {"story" : "Rick steps carefully onto the platform and looks at the levers. Each one is carved with a different symbol—one of a star, one of a swirl, and one of a hand. Aurora touches the swirl symbol floating above them. <br><br>Aurora:<em> “Maybe this is part of the way to find the Eye of Life.”</em> <be><br> The levers don’t move yet, but everything feels calm. Nothing dangerous happens, and the room stays quiet. Dog sits beside the platform, tilting his head as if he’s also trying to understand the levers. Rick laughs. <br><br> Rick:<em? “He’s probably smarter than us.”</em> <br><br> They smile and decide not to touch anything more until they know what to do next. The three of them meet again in the center of the room. They don’t know what’s coming next, but the temple doesn’t feel scary. It feels special. The Eye of Life must be close."},
            {"story" : "Aurora pats Dog and says,<em> “Go explore, boy!”</em> <br><br> Dog happily trots around the room, tail wagging. He sniffs every corner and looks behind a few broken stones. Then, near the wall, he finds a small stone tile with the swirl symbol on it and brings it back to Aurora.<br><br> Aurora:<em> “You found something!”</em> <br><br> Rick:<em> “Nice work, Dog. You might lead us to the treasure before we do.”</em> <br><br> She pets him, and he lets out a cheerful bark. The sound echoes gently through the temple. The glowing swirl on the platform shines a little brighter, as if the temple is happy too. The three of them meet again in the center of the room. They don’t know what’s coming next, but the temple doesn’t feel scary. It feels special. The Eye of Life must be close."}
        ]
    },

    "chapter5" : {
        "heading" :"Chapter 5",
        "story" : "The glowing swirl on the platform pulses softly. Then, with a gentle rumble, a round stone opens in the floor. A spiral staircase reveals itself, lit by a warm golden glow. A gentle breeze rises from below. It smells like earth, water, and something… magical.<br><br> Rick:<em> “One more step into the unknown.”</em> <br><br> But before they go down, something draws their attention to the room around them.But just as they prepare to descend, something catches their attention—a strange pull in the air around them. The room seems to shift slightly, as though it holds secrets waiting to be discovered. <br><br>Aurora looks around, her instincts telling her to be cautious.<em> “Wait, Rick, before we go… let’s make sure we haven’t missed anything.”</em>",
        "choices-question" : "What should they do before heading downstairs?",
        "choices" : [
        {"choice": "Examine the glowing swirl one last time"},
        {"choice": "Search the corners of the room"},
        {"choice": "Look up at the ceiling for hidden clues"}
        ]
    },

    "chapter6" : {
        "heading" :"Chapter 6",
        "story" : [
            {"story" : "Aurora touches the glowing symbol. It pulses gently under her fingers. A calm energy fills the room. The symbol seems to whisper without words—almost like it’s wishing them luck. <br><br>Rick:<em> “Whatever made this place… it’s watching.”</em> <br><br> They step back, feeling braver than before, and begin walking down the stairs.At the bottom, the light grows stronger. A wide chamber opens up, and in the middle floats the Eye of Life—a glowing gem full of mystery and power. They’ve almost reached the end of their journey."},
            {"story" : "Rick checks behind a few old stones and finds something shiny—an old compass! It still works and points toward the staircase. <br><br>Rick:<em> “Looks like someone left this behind.”</em> <br><br> Aurora:<em> “Maybe we’re not the first explorers here.”</em> <br><br> They tuck it into the bag and head for the stairs, curiosity burning brighter than ever. At the bottom, the light grows stronger. A wide chamber opens up, and in the middle floats the Eye of Life—a glowing gem full of mystery and power. They’ve almost reached the end of their journey."},
            {"story" : "Aurora shines her light upward. Beautiful carvings cover the ceiling—stars, rivers, and jungle trees. In the center is a symbol of three travelers and a glowing eye.<br><br> Rick:<em> “That’s us… kind of.”</em> <br><br> Aurora:<em> “I think we’re meant to be here.”</em> <br><br> They smile at each other and take their first step down the glowing stairs. At the bottom, the light grows stronger. A wide chamber opens up, and in the middle floats the Eye of Life—a glowing gem full of mystery and power. They’ve almost reached the end of their journey."}
        ]
    },

    "chapter7" : {
        "heading" :"Chapter 7",
        "story" : "Aurora, Rick, and Dog step into the glowing chamber. The air is warm, filled with soft light and a quiet hum that feels like music. In the center of the room, floating just above a smooth stone pedestal, is the Eye of Life. It’s more beautiful than they imagined — a glowing crystal that shines in colors that shift like water, like light, like dreams. They walk slowly toward it, their footsteps quiet. Dog sniffs the air and wags his tail gently.<br<br> Rick leans close and whispers, Rick:<em> “We really found it.”</em> <br><br> Aurora places her hand near the Eye. It doesn’t feel cold or hot — it feels alive. Like the jungle itself is breathing with them. As she touches it, the room begins to change. The carvings on the walls light up, one by one. The glow rises toward the ceiling, like starlight climbing vines. Then — a soft sound, like wind in trees — and the Eye gently floats down into her hands. Before they can leave, a quiet voice seems to rise from the Eye itself — not words, but feelings.",
        "choices-question" : "What should Aurora do?",
        "choices" : [
        {"choice": "Protect the Eye and leave it hidden"},
        {"choice": "Take the Eye home to study"},
        {"choice": "Ask the Eye what it wants"}
        ]
    },

    "chapter8" : {
        "heading" :"Chapter 8",
        "story" : [
            {"story" : "Aurora pauses, then chooses to leave the Eye behind. Whether guided by instinct or by the Eye itself, she places it gently back on the pedestal. The glow softens. The carvings on the walls dim, one by one, until the room returns to calm.<br><br> Rick takes a deep breath. <em>“It belongs here.”</em> <br><br>They turn back, stepping into the sunlight. Behind them, the temple quietly seals itself, as if grateful. The Eye remains where it was meant to be — hidden, protected, and in harmony with the jungle."},
            {"story" : "Aurora holds the Eye tightly.<em> “This could help so many people,”</em> she says. <br><br>They return home. The Eye becomes a global marvel — studied, displayed, admired. But little by little, its light fades. Far away, the jungle grows quieter. The magic, once alive, now feels distant. Rick looks at Aurora one evening and says, “Maybe some wonders aren’t meant to be shared.” The Eye’s power slips away from the world. The jungle, now silent, guards no more secrets."}
        ]
    }

}